#### Terraform working directory 🏠: `demo/demo-account/demo-application/opensearch`
#### Terraform Format and Style 🖌: `success`
#### Terraform Initialization ⚙️: `success`
#### Terraform Plan 📖: `success`
<details><summary>Show Plan</summary>

```hcl
terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.opensearch-instances.module.opensearch["maersk-opensearch-test"].aws_opensearch_domain.opensearch will be created
  + resource "aws_opensearch_domain" "opensearch" {
      + access_policies    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "es:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "arn:aws:es:ap-southeast-1:129980683758:domain/maersk-opensearch-test/*"
                      + Sid       = "AllowAccessToOpenSearch"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + advanced_options   = (known after apply)
      + arn                = (known after apply)
      + dashboard_endpoint = (known after apply)
      + domain_id          = (known after apply)
      + domain_name        = "maersk-opensearch-test"
      + endpoint           = (known after apply)
      + engine_version     = "OpenSearch_2.11"
      + id                 = (known after apply)
      + kibana_endpoint    = (known after apply)
      + tags               = {
          + "Name" = "maersk-opensearch-test"
        }
      + tags_all           = {
          + "Name" = "maersk-opensearch-test"
        }

      + advanced_security_options {
          + anonymous_auth_enabled         = (known after apply)
          + enabled                        = true
          + internal_user_database_enabled = true

          + master_user_options {
              + master_user_name     = "root"
              + master_user_password = (sensitive value)
            }
        }

      + auto_tune_options {
          + desired_state       = "ENABLED"
          + rollback_on_disable = "NO_ROLLBACK"
        }

      + cluster_config {
          + dedicated_master_count   = 3
          + dedicated_master_enabled = true
          + dedicated_master_type    = "r6g.large.search"
          + instance_count           = 2
          + instance_type            = "r6g.large.search"
          + warm_count               = 2
          + warm_enabled             = true
          + warm_type                = "ultrawarm1.medium.search"
          + zone_awareness_enabled   = true

          + zone_awareness_config {
              + availability_zone_count = 2
            }
        }

      + domain_endpoint_options {
          + custom_endpoint_enabled = false
          + enforce_https           = true
          + tls_security_policy     = "Policy-Min-TLS-1-2-2019-07"
        }

      + ebs_options {
          + ebs_enabled = true
          + iops        = 3000
          + throughput  = 125
          + volume_size = 10
          + volume_type = "gp3"
        }

      + encrypt_at_rest {
          + enabled    = true
          + kms_key_id = (known after apply)
        }

      + node_to_node_encryption {
          + enabled = true
        }

      + off_peak_window_options {
          + enabled = true

          + off_peak_window {
              + window_start_time {
                  + hours   = 0
                  + minutes = 0
                }
            }
        }

      + vpc_options {
          + availability_zones = (known after apply)
          + security_group_ids = [
              + "sg-08f3c88ea96172393",
            ]
          + subnet_ids         = [
              + "subnet-00081d3cb756ff906",
              + "subnet-0706830bb85c7fb8a",
            ]
          + vpc_id             = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

</details>

**Pusher**: @bitzhouwen
**Action**: pull_request
